cf/Documents/РеализацияПереданныхТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>РеализацияПереданныхТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ПередачаТовара</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыСобранные</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
				<xr:Item>AccumulationRegister.ПередачаТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоОтгрузкам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетГрузоотправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетГрузополучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаНаКонецПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МВЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МВЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураЗамена</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПередачи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВУпаковке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПередачи</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПередачаТовара</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инициатор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МВЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПлатежныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОплаты</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СобранныеТовары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СборочныйЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СборочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/AccumulationRegisters/ДолгиПоОтгрузкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ДолгиПоОтгрузкам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияПереданныхТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Documents/РеализацияПереданныхТоваров/Ext/ObjectModule.bsl
Функция ПолучитьТекстЗапросаПолученияСпискаТоваров() Экспорт
	
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура
	|ИЗ
	|	Документ.РеализацияПереданныхТоваров.Товары
	|ГДЕ
	|	Ссылка = &ДокументСсылка
	|";
	
КонецФункции
Функция ПолучитьТекстЗапросаПолученияСпискаТоваровВЯчейках() Экспорт
	
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура
	|ИЗ
	|	Документ.РеализацияПереданныхТоваров.Товары
	|ГДЕ
	|	Ссылка = &ДокументСсылка И
	|	Ячейка <> &ПустаяЯчейка
	|";
	
КонецФункции

Функция ПолучитьТекстЗапросаПолученияСпискаЗаказов() Экспорт
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Заказ
	|ИЗ
	|	Документ.РеализацияПереданныхТоваров.Товары
	|ГДЕ
	|	Ссылка = &ДокументСсылка
	|";
	
КонецФункции

// ПРЕДОПРЕДЕЛЕННЫЕ ФУНКЦИИ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Подготовка
	
	Заголовок = КонтрольПроведения.ПолучитьСтандарнтыйЗаголовокПриПроведенииДокумента(Ссылка);
	
	Документы[Метаданные().Имя].ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Последовательности
	
	//avdonin {{12.09.2010#
	//ПроведенияДокументов.ПоследовательностьОстаткиТоваров(ДополнительныеСвойства, ПринадлежностьПоследовательностям, Отказ);
	//}}avdonin
	
	// Проведение
	
	ПроведенияДокументов.ПровестиПоВсемРегистрам(Метаданные().Движения, ДополнительныеСвойства, Движения, Отказ);
	                                     
	// Запись
	
	Движения.Записать();
	
	// Контроль
	
	КонтрольПроведения.ПроверитьПередачаТовара(ЭтотОбъект, Отказ, Заголовок);
	
	
	// в очередь на отправку
	 
	//Запись = РегистрыСведений.ОтправкаЗаказов.СоздатьМенеджерЗаписи();
		
	//Запись.Заказ 			= Заказ;
	//Запись.Отправлен 		= Ложь;
	
	//Если Не ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Запись) Тогда Отказ = Истина КонецЕсли;
		
	// Обновим журнал заказа
	
	//Если Не Заказы.ОбновитьРеквизитыЖурнала(Заказ) Тогда Отказ = Истина КонецЕсли;
		
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Контроль
	
	КонтрольПроведения.ПроверитьТоварыНаСкладах(ЭтотОбъект, Склад, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Сумма = Товары.Итог("Сумма") + ?(СуммаВключаетНДС,0,Товары.Итог("СуммаНДС"));
	СуммаАванса = ПлатежныеДокументы.Итог("Сумма");
	                 
	// Установим подразделение
	
	Если Подразделение.Пустая() Тогда
		
		Если 	Не Партнер.ОсновнойМенеджер.Пустая() И
				Не Партнер.ОсновнойМенеджер.Подразделение.Пустая() Тогда
				
			Подразделение = Партнер.ОсновнойМенеджер.Подразделение;
			
		ИначеЕсли Не Склад.Подразделение.Пустая() Тогда
			
			Подразделение = Склад.Подразделение; КонецЕсли; КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанных = ТипЗнч(ДанныеЗаполнения);
	Если ТипДанных = Тип("ДокументСсылка.ПередачаТовара") Тогда
		///Передача товара (Череповец)
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ПередачаТовара.Контрагент,
		                      |	ПередачаТовара.Организация,
		                      |	ПередачаТовара.Партнер,
		                      |	ПередачаТовара.Склад,
		                      |	ПередачаТовара.ТипЦен,
							  |	ПередачаТовара.БанковскийСчетОрганизации,
		                      |	ПередачаТовара.БанковскийСчетПартнера,
		                      |	ПередачаТовара.Товары.(
		                      |		Номенклатура,
		                      |		Количество,
		                      |		Цена,
		                      |		Сумма,
		                      |		Упаковка,
		                      |		КоличествоВУпаковке,
		                      |		СтавкаНДС,
		                      |		СуммаНДС,
		                      |		Размещение
		                      |	)
		                      |ИЗ
		                      |	Документ.ПередачаТовара КАК ПередачаТовара
		                      |ГДЕ
		                      |	ПередачаТовара.Ссылка = &Док");
		Запрос.УстановитьПараметр("Док", ДанныеЗаполнения);
		ВыборкаШапки = Запрос.Выполнить().Выбрать();
		Если ВыборкаШапки.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапки);
			Товары.Загрузить(ВыборкаШапки.Товары.Выгрузить());
		КонецЕсли;			
		///////////////////////////////////
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		                                           
	ПроверяемыеРеквизиты.Добавить("Партнер");
		
КонецПроцедуры


// ОПЛАТА

Процедура ЗаполнитьДокументыОплаты(СсылкаРеализации = Неопределено) Экспорт
	
	Запрос = Новый Запрос("
	
	// Оплата конкретного заказа
	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Регистратор ДокументОплаты,
	|	СУММА(СуммаРасход) Сумма
	|ИЗ
	|	РегистрНакопления.ДолгиПоОтгрузкам.ОстаткиИОбороты(,&Дата,РЕГИСТРАТОР,,
	|					Организация 		= &Организация И 
	|					Партнер 			= &Партнер И 
	//|					Контрагент 			= &Контрагент И
	|					Заказ 				= &Заказ И
	|					(ДокументОтгрузки	= &Ссылка ИЛИ ДокументОтгрузки = НЕОПРЕДЕЛЕНО))
	|
	|ГДЕ
	|	СуммаРасход > 0 И
	|	НЕ Регистратор ССЫЛКА Документ.РеализацияПереданныхТоваров И
	|	НЕ Регистратор ССЫЛКА Документ.ЗаказПокупателя И
	|	НЕ Регистратор ССЫЛКА Документ.ИнтернетЗаказПокупателя И
	|	НЕ Регистратор ССЫЛКА Документ.ЗаказНаряд
	|
	|СГРУППИРОВАТЬ ПО
	|	Регистратор
	|;
	
	// Оплата авансом
	
	|ВЫБРАТЬ
	|	Регистратор ДокументОплаты,
	|	СУММА(СуммаРасход) Сумма
	|ИЗ
	|	РегистрНакопления.ДолгиПоОтгрузкам.ОстаткиИОбороты(,&Дата,РЕГИСТРАТОР,,
	|					Организация 		= &Организация И 
	|					Партнер 			= &Партнер И 
	//|					Контрагент 			= &Контрагент И
	|					Заказ 				= НЕОПРЕДЕЛЕНО )
	|
	|ГДЕ
	|	СуммаРасход > 0 И
	|	НЕ Регистратор ССЫЛКА Документ.РеализацияПереданныхТоваров И
	|	НЕ Регистратор ССЫЛКА Документ.ЗаказПокупателя И
	|	НЕ Регистратор ССЫЛКА Документ.ИнтернетЗаказПокупателя И
	|	НЕ Регистратор ССЫЛКА Документ.ЗаказНаряд
	|
	|СГРУППИРОВАТЬ ПО
	|	Регистратор
	|");
	
	Запрос.УстановитьПараметр("Ссылка",		Ссылка);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Партнер", 	Партнер);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Дата", 		Дата);
	Запрос.УстановитьПараметр("Заказ", 		Заказ);
	УстановитьПривилегированныйРежим(Истина);
	Пакет = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	Нужно = Сумма;
	
	ПлатежныеДокументы.Очистить();
	ДобавитьВОплаты(Пакет[0].Выбрать(), Нужно);
	
	Оплачено = Сумма - Нужно;
	Если Нужно Тогда
		ДобавитьВОплаты(Пакет[1].Выбрать(), Нужно)	
	КонецЕсли;
	
	СуммаАванса = Сумма - Оплачено - Нужно;
		
КонецПроцедуры
Процедура ДобавитьВОплаты(Выборка, Нужно)
	
	Пока Выборка.Следующий() Цикл
		
		Берем = Мин(Нужно, Выборка.Сумма);
		Если Берем Тогда
			ЗаполнитьЗначенияСвойств(ПлатежныеДокументы.Добавить(), Выборка);
		КонецЕсли;
		
		Нужно = Нужно - берем;
		
	КонецЦикла;
	
КонецПроцедуры
Процедура ЗаполнитьДокументыОплаты_Ст(СсылкаРеализации = Неопределено) Экспорт
	
	Запрос = Новый Запрос("
	
	// Аванс
	
	|ВЫБРАТЬ Партнер,СУММА(-СуммаОстаток) Сумма ИЗ РегистрНакопления.ДолгиПоОтгрузкам.Остатки(
	|" + ?(Проведен, "&Дата", "") + "
	|					,	Организация 	= &Организация И 
	|						Партнер 		= &Партнер)
	//|						Контрагент 		= &Контрагент)
	|СГРУППИРОВАТЬ ПО
	|	Партнер
	|ИМЕЮЩИЕ СУММА(-СуммаОстаток) > 0
	|;
	
	// Закрывающий заказ
	
	|ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО	ДокументОплаты,
	|	Заказ,
	|	Заказ.Валюта	Валюта,
	|	СуммаОстаток 	Сумма
	|ИЗ
	|	РегистрНакопления.ДолгиПоОтгрузкам.Остатки(&Дата, 
	|									Организация = &Организация И 
	|									Партнер 	= &Партнер И 
	//|									Контрагент 	= &Контрагент И
	|									ДокументОтгрузки = НЕОПРЕДЕЛЕНО И
	|									Заказ			= &Заказ)
	|ГДЕ
	|	СуммаОстаток > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Регистратор,
	|	Заказ,
	|	Регистратор.Валюта,
	|	СуммаРасход
	|ИЗ
	|	РегистрНакопления.ДолгиПоОтгрузкам.ОстаткиИОбороты(,&Дата,РЕГИСТРАТОР,,
	|					Организация 		= &Организация И 
	|					Партнер 			= &Партнер И 
	//|					Контрагент 			= &Контрагент И
	|					ДокументОтгрузки 	= НЕОПРЕДЕЛЕНО)
	|
	|ГДЕ
	|	СуммаРасход > 0 И
	|	НЕ Регистратор ССЫЛКА Документ.РеализацияПереданныхТоваров И
	|	НЕ Регистратор ССЫЛКА Документ.ЗаказПокупателя И
	|	НЕ Регистратор ССЫЛКА Документ.ИнтернетЗаказПокупателя И
	|	НЕ Регистратор ССЫЛКА Документ.ЗаказНаряд
	|");
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Партнер", 	Партнер);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Дата", 		Дата);
	Запрос.УстановитьПараметр("Заказ", 		Заказ);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	Выборка 	= Пакет[0].Выбрать();
	СуммаАванса = ?(Выборка.Следующий(),
								Мин(Выборка.Сумма, Сумма),
								0);
								
	//РасшифровкаПлатежа.Загрузить(Пакет[1].Выгрузить());
								
КонецПроцедуры
